src/cf/InformationRegisters/СформированныеСообщенияСИзмененнымиНомерамиМПУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СформированныеСообщенияСИзмененнымиНомерамиМПУНФ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодУзла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодУзла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказМП</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходДенегМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажахМП</v8:Type>
						<v8:Type>cfg:CatalogRef.СпецификацииМП</v8:Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККММП</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницыМП</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиМП</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходТовараМП</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтрагентыМП</v8:Type>
						<v8:Type>cfg:CatalogRef.ТоварыМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМВозвратМП</v8:Type>
						<v8:Type>cfg:CatalogRef.КассыККММП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходТовараМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизводствоМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходДенегМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/СинхронизацияМПУНФ/Ext/Module.bsl
#Область ЗапускФоновогоЗаданияДляСервера

Процедура ЗапуститьУдалениеНомеровВФоновомЗадании(СтруктураЗапроса) Экспорт
	
	РегистрыСведений.СформированныеСообщенияСИзмененнымиНомерамиМПУНФ.УдалитьСообщение(СтруктураЗапроса.НомерСообщения, СтруктураЗапроса.КодКлиентскогоУзла);
	
КонецПроцедуры

Процедура СоздатьСообщениеСПодтвержденнымиНомерами(КодУзла) Экспорт
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.Ссылка КАК Ссылка,
	|	НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.Номер КАК Номер
	|ИЗ
	|	РегистрСведений.НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП КАК НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП
	|ГДЕ
	|	НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.КодУзла = &КодУзла";
	
	Запрос.УстановитьПараметр("КодУзла", КодУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивСЗаписями = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура("Ссылка, Номер", ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Номер);
		МассивСЗаписями.Добавить(Структура);
		РегистрыСведений.НомераСправочниковИДокументовДляИзмененияНаКлиентскомУзлеМП.УдалитьЗапись(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Если МассивСЗаписями.Количество() > 0 Тогда
		
		НомерСообщенияОбмена = РегистрыСведений.СформированныеСообщенияСИзмененнымиНомерамиМПУНФ.ПолучитьНомерСообщения();
		
		НаборЗаписей = РегистрыСведений.СформированныеСообщенияСИзмененнымиНомерамиМПУНФ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номер.Установить(НомерСообщенияОбмена);
		НаборЗаписей.Отбор.КодУзла.Установить(КодУзла);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Номер = НомерСообщенияОбмена;
		НоваяЗапись.КодУзла = КодУзла;
		НоваяЗапись.Сообщение = Новый ХранилищеЗначения(МассивСЗаписями, Новый СжатиеДанных(9));
		
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти

#Область ТекущаяВерсияПриложения

Функция ПолучитьТекущуюВерсиюПриложения() Экспорт
	
	Возврат "2.0.8.1"
	
КонецФункции

#КонецОбласти
